Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets
The SelectionSets stored in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.AddComment(Autodesk.Navisworks.Api.SavedItem,Autodesk.Navisworks.Api.Comment)
Edit item and add Comment to item's Comments
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentException:
Argument 'item' is not contained by SelectionSets

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.AddCopy(Autodesk.Navisworks.Api.GroupItem,Autodesk.Navisworks.Api.SavedItem)
Adds a copy of item to the end of the specified parent group contained by SelectionSets.
parent:
The parent group to add to. RootItem or null to add directly to Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by Selectionsets
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.AddCopy(Autodesk.Navisworks.Api.SavedItem)
Adds a copy of item to the end of Value.
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Changed
Occurs when the SelectionSets contained in this object has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Changing
Occurs when the Selection contained in this object is about to change

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Clear
Removes all items in Value

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.CopyFrom(Autodesk.Navisworks.Api.SavedItemCollection)
Copies the SelectionSets from value and
replaces the list of entries held in Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Value.

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.SavedItem})
Copies the SelectionSets from value and replaces the list of entries held
in Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Value.

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.CreateCopy
Creates a copy of the SelectionSets associated with this object

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.CreateIndexPath(Autodesk.Navisworks.Api.SavedItem)
Returns a collection of indices that defines a path from the root item through its
descendents to the specified item.
Throws System.ArgumentException:
Item is not contained in this document part

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.CreateReference(Autodesk.Navisworks.Api.SavedItem)
Returns a reference to a saved item.
Throws System.ArgumentException:
Argument 'item' is not contained in this document part

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.CreateSelectionSource(Autodesk.Navisworks.Api.SavedItem)
Returns a selection source that refers to the selection defined by a Selection Set
or folder of Selection Sets.
Throws System.ArgumentException:
Argument 'item' is not contained in this document part

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.EditComments(Autodesk.Navisworks.Api.SavedItem,Autodesk.Navisworks.Api.CommentCollection)
Edit item and update it's Comments
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentException:
Argument 'item' is not contained by SelectionSets

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.EditDisplayName(Autodesk.Navisworks.Api.SavedItem,System.String)
Edit item and update it's DisplayName
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentException:
Argument 'item' is not contained by SelectionSets

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Id
The internal identifier for this type of document part.

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.InsertCopy(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.SavedItem)
Inserts a copy of item into the specified parent group contained by SelectionSets.
parent:
The parent group to insert into. RootItem or null to insert directly into Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by Selectionsets
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.InsertCopy(System.Int32,Autodesk.Navisworks.Api.SavedItem)
Inserts a copy of item into Value.
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Move(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.GroupItem,System.Int32)
Moves item at oldIndex in OldParent to newIndex in newParent
oldParent:
The parent group to move the item from. RootItem or null to remove directly from Value
newParent:
The parent group to move to. RootItem or null to move directly into Value.
If newParent is equal to oldParent, the item will be moved within the same SavedItemCollection.
Throws System.ArgumentException:
Argument 'oldParent' has been Disposed
Throws System.ArgumentException:
Argument 'oldParent' is not contained by Selectionsets
Throws System.ArgumentException:
Argument 'newParent' has been Disposed
Throws System.ArgumentException:
Argument 'newParent' is not contained by Selectionsets
Throws System.ArgumentOutOfRangeException:
Argument 'oldIndex' out of range
Throws System.ArgumentOutOfRangeException:
Argument 'newIndex' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Move(System.Int32,System.Int32)
Moves item from oldIndex to newIndex within Value
Throws System.ArgumentOutOfRangeException:
Argument 'oldIndex' out of range
Throws System.ArgumentOutOfRangeException:
Argument 'newIndex' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets)~Autodesk.Navisworks.Api.SavedItemCollection
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Remove(Autodesk.Navisworks.Api.GroupItem,Autodesk.Navisworks.Api.SavedItem)
Removes specified item from the specified parent group contained by SelectionSets.
parent:
The parent group to remove from. RootItem or null to remove directly from Value
Returns:
false if item not found in Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by Selectionsets
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Remove(Autodesk.Navisworks.Api.SavedItem)
Removes specified item from Value.
Returns:
false if item not found in Value
Throws System.ArgumentException:
Argument 'item' has been Disposed

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.RemoveAt(Autodesk.Navisworks.Api.GroupItem,System.Int32)
Removes item from the specified parent group contained by SelectionSets.
parent:
The parent group to remove from. RootItem or null to remove directly from Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by Selectionsets
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.RemoveAt(System.Int32)
Removes item at the specified index from Value.
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ReplaceWithCopy(Autodesk.Navisworks.Api.GroupItem,System.Int32,Autodesk.Navisworks.Api.SavedItem)
Replaces item from the specified parent group with a copy of item
parent:
The parent group to insert into. RootItem or null to insert directly into Value
Throws System.ArgumentException:
Argument 'parent' has been Disposed
Throws System.ArgumentException:
Argument 'parent' is not contained by Selectionsets
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ReplaceWithCopy(System.Int32,Autodesk.Navisworks.Api.SavedItem)
Replaces item at given index within Value with a copy of item
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' contains an unsupported type of SavedItem
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ResolveGuid(System.Guid)
Returns the saved item referenced by a guid.

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ResolveIndexPath(System.Collections.Generic.IEnumerable{System.Int32})
Returns the saved item referenced by a collection of indices that define a path from the
root item through its descendents to the specified item.
Returns:
null if source cannot be resolved
Throws System.ArgumentNullException:
Argument 'path' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ResolveReference(Autodesk.Navisworks.Api.SavedItemReference)
Returns the saved item referenced by a SavedItemReference.
Throws System.ArgumentException:
DocumentPartId on reference does not match the Id of this part
Throws System.ArgumentNullException:
Argument 'reference' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ResolveSelectionSource(Autodesk.Navisworks.Api.SelectionSource)
Returns the saved item referenced by a SelectionSource
Returns:
null if source cannot be resolved
Throws System.ArgumentNullException:
Argument 'source' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.RootItem
Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Value as the children of a Autodesk.Navisworks.Api.FolderItem

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.ToSavedItemCollection
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentSelectionSets.Value
The collection of SelectionSets stored in the Document